Xelus22/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/at32f403axx.h
/**************************************************************************//**
 * @file     at32f403axx.h
 * @brief    CMSIS Core Peripheral Access Layer Header File for
 *           at32f403axx Device Series
 * @version  V0.0.1
 * @date     7-June-2022
 ******************************************************************************/
/*
    Copyright (c) Harrison Chan (@xelus22)

    All rights reserved.
    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f103xb
  * @{
  */
    
#ifndef __AT32F403Axx_H
#define __AT32F403Axx_H

#if !defined(WB32F3G71xx)
  #define WB32F3G71xx
#endif

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions */
#endif
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

/** @addtogroup Library_configuration_section
  * @{
  */

#if !defined  USE_STDPERIPH_DRIVER
/**
 * @brief Comment the line below if you will not use the peripherals drivers.
 * In this case, these drivers will not be included and the application code will
 * be based on direct access to peripherals registers
 */
  /*#define USE_STDPERIPH_DRIVER*/
#endif

/**
  * @brief at32f403a standard peripheral library version number
  */
#define __AT32F403A_LIBRARY_VERSION_MAJOR    (0x02) /*!< [31:24] major version */
#define __AT32F403A_LIBRARY_VERSION_MIDDLE   (0x00) /*!< [23:16] middle version */
#define __AT32F403A_LIBRARY_VERSION_MINOR    (0x06) /*!< [15:8]  minor version */
#define __AT32F403A_LIBRARY_VERSION_RC       (0x00) /*!< [7:0]  release candidate */
#define __AT32F403A_LIBRARY_VERSION          ((__AT32F403A_LIBRARY_VERSION_MAJOR << 24)  | \
                                              (__AT32F403A_LIBRARY_VERSION_MIDDLE << 16) | \
                                              (__AT32F403A_LIBRARY_VERSION_MINOR << 8)   | \
                                              (__AT32F403A_LIBRARY_VERSION_RC))

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
/**
  * @brief Configuration of the Cortex-M3 Processor and Core Peripherals 
 */
#define __CM4_REV                 0x0001U  /*!< core revision r0p1                           */
#define __MPU_PRESENT             1        /*!< mpu present                                  */
#define __NVIC_PRIO_BITS          4        /*!< at32 uses 4 bits for the priority levels     */
#define __Vendor_SysTickConfig    0        /*!< set to 1 if different systick config is used */
#define __FPU_PRESENT             1U       /*!< fpu present                                  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief AT32F403Axx Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */

 /*!< Interrupt Number Definition */
typedef enum
{
    /******  cortex-m4 processor exceptions numbers ***************************************************/
    Reset_IRQn                  = -15,    /*!< 1 reset vector, invoked on power up and warm reset   */
    NonMaskableInt_IRQn         = -14,    /*!< 2 non maskable interrupt                             */
    HardFault_IRQn              = -13,    /*!< 3 hard fault, all classes of fault                   */
    MemoryManagement_IRQn       = -12,    /*!< 4 cortex-m4 memory management interrupt              */
    BusFault_IRQn               = -11,    /*!< 5 cortex-m4 bus fault interrupt                      */
    UsageFault_IRQn             = -10,    /*!< 6 cortex-m4 usage fault interrupt                    */
    SVCall_IRQn                 = -5,     /*!< 11 cortex-m4 sv call interrupt                       */
    DebugMonitor_IRQn           = -4,     /*!< 12 cortex-m4 debug monitor interrupt                 */
    PendSV_IRQn                 = -2,     /*!< 14 cortex-m4 pend sv interrupt                       */
    SysTick_IRQn                = -1,     /*!< 15 cortex-m4 system tick interrupt                   */

    /******  at32 specific interrupt numbers *********************************************************/
    WWDG_IRQn                   = 0,      /*!< window watchdog timer interrupt                      */
    PVD_IRQn                    = 1,      /*!< pvm through exint line detection interrupt           */
    TAMPER_IRQn                 = 2,      /*!< tamper interrupt                                     */
    RTC_IRQn                    = 3,      /*!< rtc global interrupt                                 */
    FLASH_IRQn                  = 4,      /*!< flash global interrupt                               */
    RCC_IRQn                    = 5,      /*!< crm global interrupt                                 */
    EXTI0_IRQn                  = 6,      /*!< external line0 interrupt                             */
    EXTI1_IRQn                  = 7,      /*!< external line1 interrupt                             */
    EXTI2_IRQn                  = 8,      /*!< external line2 interrupt                             */
    EXTI3_IRQn                  = 9,      /*!< external line3 interrupt                             */
    EXTI4_IRQn                  = 10,     /*!< external line4 interrupt                             */
    DMA1_Channel1_IRQn          = 11,     /*!< dma1 channel 1 global interrupt                      */
    DMA1_Channel2_IRQn          = 12,     /*!< dma1 channel 2 global interrupt                      */
    DMA1_Channel3_IRQn          = 13,     /*!< dma1 channel 3 global interrupt                      */
    DMA1_Channel4_IRQn          = 14,     /*!< dma1 channel 4 global interrupt                      */
    DMA1_Channel5_IRQn          = 15,     /*!< dma1 channel 5 global interrupt                      */
    DMA1_Channel6_IRQn          = 16,     /*!< dma1 channel 6 global interrupt                      */
    DMA1_Channel7_IRQn          = 17,     /*!< dma1 channel 7 global interrupt                      */
    ADC1_2_IRQn                 = 18,     /*!< adc1 and adc2 global interrupt                       */
    USB_HP_CAN1_TX_IRQn         = 19,     /*!< usb device high priority or can1 tx interrupts       */
    USB_LP_CAN1_RX0_IRQn        = 20,     /*!< usb device low priority or can1 rx0 interrupts       */
    CAN1_RX1_IRQn               = 21,     /*!< can1 rx1 interrupt                                   */
    CAN1_SCE_IRQn               = 22,     /*!< can1 se interrupt                                    */
    EXTI9_5_IRQn                = 23,     /*!< external line[9:5] interrupts                        */
    TIM1_BRK_IRQn               = 24,     /*!< tmr1 brake interrupt                                 */
    TIM1_UP_IRQn                = 25,     /*!< tmr1 overflow interrupt                              */
    TIM1_TRG_COM_IRQn           = 26,     /*!< tmr1 trigger and hall interrupt                      */
    TIM1_CC_IRQn                = 27,     /*!< tmr1 channel interrupt                               */
    TIM2_IRQn                   = 28,     /*!< tmr2 global interrupt                                */
    TIM3_IRQn                   = 29,     /*!< tmr3 global interrupt                                */
    TIM4_IRQn                   = 30,     /*!< tmr4 global interrupt                                */
    I2C1_EV_IRQn                = 31,     /*!< i2c1 event interrupt                                 */
    I2C1_ER_IRQn                = 32,     /*!< i2c1 error interrupt                                 */
    I2C2_EV_IRQn                = 33,     /*!< i2c2 event interrupt                                 */
    I2C2_ER_IRQn                = 34,     /*!< i2c2 error interrupt                                 */
    SPI1_IRQn                   = 35,     /*!< spi1 global interrupt                                */
    SPI2_IRQn                   = 36,     /*!< spi2 global interrupt                                */
    USART1_IRQn                 = 37,     /*!< usart1 global interrupt                              */
    USART2_IRQn                 = 38,     /*!< usart2 global interrupt                              */
    USART3_IRQn                 = 39,     /*!< usart3 global interrupt                              */
    EXTI15_10_IRQn              = 40,     /*!< external line[15:10] interrupts                      */
    RTC_Alarm_IRQn              = 41,     /*!< rtc alarm through exint line interrupt               */
    USBWakeUp_IRQn              = 42,     /*!< usb device wakeup from suspend through exint line interrupt */
    TIM8_BRK_IRQn               = 43,     /*!< tmr8 brake interrupt                                 */
    TIM8_UP_IRQn                = 44,     /*!< tmr8 overflow interrupt                              */
    TIM8_TRG_COM_IRQn           = 45,     /*!< tmr8 trigger and hall interrupt                      */
    TIM8_CC_IRQn                = 46,     /*!< tmr8 channel interrupt                               */
    ADC3_IRQn                   = 47,     /*!< adc3 global interrupt                                */
    FSMC_IRQn                   = 48,     /*!< xmc global interrupt                                 */
    SDIO_IRQn                   = 49,     /*!< sdio1 global interrupt                               */
    TIM5_IRQn                   = 50,     /*!< tmr5 global interrupt                                */
    SPI3_IRQn                   = 51,     /*!< spi3 global interrupt                                */
    UART4_IRQn                  = 52,     /*!< uart4 global interrupt                               */
    UART5_IRQn                  = 53,     /*!< uart5 global interrupt                               */
    TIM6_IRQn                   = 54,     /*!< tmr6 global interrupt                                */
    TIM7_IRQn                   = 55,     /*!< tmr7 global interrupt                                */
    DMA2_Channel1_IRQn          = 56,     /*!< dma2 channel 1 global interrupt                      */
    DMA2_Channel2_IRQn          = 57,     /*!< dma2 channel 2 global interrupt                      */
    DMA2_Channel3_IRQn          = 58,     /*!< dma2 channel 3 global interrupt                      */
    DMA2_Channel4_5_IRQn        = 59,     /*!< dma2 channel 4 and channel 5 global interrupt        */
    SDIO2_IRQn                  = 60,     /*!< sdio2 global interrupt                               */
    I2C3_EVT_IRQn               = 61,     /*!< i2c3 event interrupt                                 */
    I2C3_ERR_IRQn               = 62,     /*!< i2c3 error interrupt                                 */
    SPI4_IRQn                   = 63,     /*!< spi4 global interrupt                                */
    CAN2_TX_IRQn                = 68,     /*!< can2 tx interrupt                                    */
    CAN2_RX0_IRQn               = 69,     /*!< can2 rx0 interrupt                                   */
    CAN2_RX1_IRQn               = 70,     /*!< can2 rx1 interrupt                                   */
    CAN2_SE_IRQn                = 71,     /*!< can2 se interrupt                                    */
    ACC_IRQn                    = 72,     /*!< acc interrupt                                        */
    USBFS_MAPH_IRQn             = 73,     /*!< usb map hp interrupt                                 */
    USBFS_MAPL_IRQn             = 74,     /*!< usb map lp interrupt                                 */
    DMA2_Channel6_7_IRQn        = 75,     /*!< dma2 channel 6 and channel 7 global interrupt        */
    USART6_IRQn                 = 76,     /*!< usart6 interrupt                                     */
    UART7_IRQn                  = 77,     /*!< uart7 interrupt                                      */
    UART8_IRQn                  = 78,     /*!< uart8 interrupt                                      */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm4.h"
#include "system_at32f4xx.h"
#include <stdint.h>

