Xelus22/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/at32f403axx.h
#define FLASH_BASE            0x08000000U /*!< FLASH base address in the alias region */
#define FLASH_BANK1_END       0x0803FFFFU /*!< FLASH END address of bank1 */
#define SRAM_BASE             0x20000000U /*!< SRAM base address in the alias region */
#define PERIPH_BASE           0x40000000U /*!< Peripheral base address in the alias region */

#define SRAM_BB_BASE          0x22000000U /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        0x42000000U /*!< Peripheral base address in the bit-band region */

#define FSMC_BASE             0x60000000U /*!< FSMC base address */
#define FSMC_R_BASE           0xA0000000U /*!< FSMC registers base address */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       (PERIPH_BASE + 0x00000000U)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000U)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000U)

#define RCC_BASE              (AHBPERIPH_BASE + 0x00001000U)
#define CRC_BASE              (AHBPERIPH_BASE + 0x00003000U)

/* apb1 bus base address */
#define TMR2_BASE                        (APB1PERIPH_BASE + 0x0000U)
#define TMR3_BASE                        (APB1PERIPH_BASE + 0x0400U)
#define TMR4_BASE                        (APB1PERIPH_BASE + 0x0800U)
#define TMR5_BASE                        (APB1PERIPH_BASE + 0x0C00U)
#define TMR6_BASE                        (APB1PERIPH_BASE + 0x1000U)
#define TMR7_BASE                        (APB1PERIPH_BASE + 0x1400U)
#define TMR12_BASE                       (APB1PERIPH_BASE + 0x1800U)
#define TMR13_BASE                       (APB1PERIPH_BASE + 0x1C00U)
#define TMR14_BASE                       (APB1PERIPH_BASE + 0x2000U)
#define RTC_BASE                         (APB1PERIPH_BASE + 0x2800U)
#define WWDG_BASE                        (APB1PERIPH_BASE + 0x2C00U)
#define IWDG_BASE                        (APB1PERIPH_BASE + 0x3000U) //WDT
#define SPI2_BASE                        (APB1PERIPH_BASE + 0x3800U)
#define SPI3_BASE                        (APB1PERIPH_BASE + 0x3C00U)
#define SPI4_BASE                        (APB1PERIPH_BASE + 0x4000U)
#define USART2_BASE                      (APB1PERIPH_BASE + 0x4400U)
#define USART3_BASE                      (APB1PERIPH_BASE + 0x4800U)
#define UART4_BASE                       (APB1PERIPH_BASE + 0x4C00U)
#define UART5_BASE                       (APB1PERIPH_BASE + 0x5000U)
#define I2C1_BASE                        (APB1PERIPH_BASE + 0x5400U)
#define I2C2_BASE                        (APB1PERIPH_BASE + 0x5800U)
#define USBFS_BASE                       (APB1PERIPH_BASE + 0x5C00U)
#define CAN1_BASE                        (APB1PERIPH_BASE + 0x6400U)
#define CAN2_BASE                        (APB1PERIPH_BASE + 0x6800U)
#define BKP_BASE                         (APB1PERIPH_BASE + 0x6C00U) //BKPR
#define PWR_BASE                         (APB1PERIPH_BASE + 0x7000U) //PWC
#define DAC_BASE                         (APB1PERIPH_BASE + 0x7400U)
/* apb2 bus base address */              
#define AFIO_BASE                        (APB2PERIPH_BASE + 0x0000U) //IOMUX
#define EXTI_BASE                        (APB2PERIPH_BASE + 0x0400U)
#define GPIOA_BASE                       (APB2PERIPH_BASE + 0x0800U)
#define GPIOB_BASE                       (APB2PERIPH_BASE + 0x0C00U)
#define GPIOC_BASE                       (APB2PERIPH_BASE + 0x1000U)
#define GPIOD_BASE                       (APB2PERIPH_BASE + 0x1400U)
#define GPIOE_BASE                       (APB2PERIPH_BASE + 0x1800U)
#define ADC1_BASE                        (APB2PERIPH_BASE + 0x2400U)
#define ADC2_BASE                        (APB2PERIPH_BASE + 0x2800U)
#define TMR1_BASE                        (APB2PERIPH_BASE + 0x2C00U)
#define SPI1_BASE                        (APB2PERIPH_BASE + 0x3000U)
#define TMR8_BASE                        (APB2PERIPH_BASE + 0x3400U)
#define USART1_BASE                      (APB2PERIPH_BASE + 0x3800U)
#define ADC3_BASE                        (APB2PERIPH_BASE + 0x3C00U)
#define TMR9_BASE                        (APB2PERIPH_BASE + 0x4C00U)
#define TMR10_BASE                       (APB2PERIPH_BASE + 0x5000U)
#define TMR11_BASE                       (APB2PERIPH_BASE + 0x5400U)
#define ACC_BASE                         (APB2PERIPH_BASE + 0x5800U)
#define I2C3_BASE                        (APB2PERIPH_BASE + 0x5C00U)
#define USART6_BASE                      (APB2PERIPH_BASE + 0x6000U)
#define UART7_BASE                       (APB2PERIPH_BASE + 0x6400U)
#define UART8_BASE                       (APB2PERIPH_BASE + 0x6800U)
#define I2S2EXT_BASE                     (APB2PERIPH_BASE + 0x6C00U)
#define I2S3EXT_BASE                     (APB2PERIPH_BASE + 0x7000U)
#define SDIO_BASE SDIO1_BASE
#define SDIO1_BASE                       (APB2PERIPH_BASE + 0x8000U) //SDIO_BASE
/* ahb bus base address */               
#define DMA1_BASE                        (AHBPERIPH_BASE + 0x0000U)
#define DMA1_Channel1_BASE               (AHBPERIPH_BASE + 0x0008U)
#define DMA1_Channel2_BASE               (AHBPERIPH_BASE + 0x001CU)
#define DMA1_Channel3_BASE               (AHBPERIPH_BASE + 0x0030U)
#define DMA1_Channel4_BASE               (AHBPERIPH_BASE + 0x0044U)
#define DMA1_Channel5_BASE               (AHBPERIPH_BASE + 0x0058U)
#define DMA1_Channel6_BASE               (AHBPERIPH_BASE + 0x006CU)
#define DMA1_Channel7_BASE               (AHBPERIPH_BASE + 0x0080U)
#define DMA2_BASE                        (AHBPERIPH_BASE + 0x0400U)
#define DMA2_Channel1_BASE               (AHBPERIPH_BASE + 0x0408U)
#define DMA2_Channel2_BASE               (AHBPERIPH_BASE + 0x041CU)
#define DMA2_Channel3_BASE               (AHBPERIPH_BASE + 0x0430U)
#define DMA2_Channel4_BASE               (AHBPERIPH_BASE + 0x0444U)
#define DMA2_Channel5_BASE               (AHBPERIPH_BASE + 0x0458U)
#define DMA2_Channel6_BASE               (AHBPERIPH_BASE + 0x046CU)
#define DMA2_Channel7_BASE               (AHBPERIPH_BASE + 0x0480U)
#define CRM_BASE                         (AHBPERIPH_BASE + 0x1000U)
#define FLASH_REG_BASE                   (AHBPERIPH_BASE + 0x2000U)
#define CRC_BASE                         (AHBPERIPH_BASE + 0x3000U)
#define SDIO2_BASE                       (AHBPERIPH_BASE + 0x3400U)

#define FSMC_BANK1            (FSMC_BASE)               /*!< FSMC Bank1 base address */
#define FSMC_BANK1_1          (FSMC_BANK1)              /*!< FSMC Bank1_1 base address */
#define FSMC_BANK1_2          (FSMC_BANK1 + 0x04000000U) /*!< FSMC Bank1_2 base address */
#define FSMC_BANK1_3          (FSMC_BANK1 + 0x08000000U) /*!< FSMC Bank1_3 base address */
#define FSMC_BANK1_4          (FSMC_BANK1 + 0x0C000000U) /*!< FSMC Bank1_4 base address */

