Xelus22/ChibiOS-Contrib/os/common/ext/CMSIS/AT32/at32f403axx.h
/*!< HPRE configuration */
#define RCC_CFGR_HPRE_Pos                    (4U)
#define RCC_CFGR_HPRE_Msk                    (0xFU << RCC_CFGR_HPRE_Pos)       /*!< 0x000000F0 */
#define RCC_CFGR_HPRE                        RCC_CFGR_HPRE_Msk                 /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_0                      (0x1U << RCC_CFGR_HPRE_Pos)       /*!< 0x00000010 */
#define RCC_CFGR_HPRE_1                      (0x2U << RCC_CFGR_HPRE_Pos)       /*!< 0x00000020 */
#define RCC_CFGR_HPRE_2                      (0x4U << RCC_CFGR_HPRE_Pos)       /*!< 0x00000040 */
#define RCC_CFGR_HPRE_3                      (0x8U << RCC_CFGR_HPRE_Pos)       /*!< 0x00000080 */

#define RCC_CFGR_HPRE_DIV1                   0x00000000U                       /*!< SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2                   0x00000080U                       /*!< SYSCLK divided by 2 */
#define RCC_CFGR_HPRE_DIV4                   0x00000090U                       /*!< SYSCLK divided by 4 */
#define RCC_CFGR_HPRE_DIV8                   0x000000A0U                       /*!< SYSCLK divided by 8 */
#define RCC_CFGR_HPRE_DIV16                  0x000000B0U                       /*!< SYSCLK divided by 16 */
#define RCC_CFGR_HPRE_DIV64                  0x000000C0U                       /*!< SYSCLK divided by 64 */
#define RCC_CFGR_HPRE_DIV128                 0x000000D0U                       /*!< SYSCLK divided by 128 */
#define RCC_CFGR_HPRE_DIV256                 0x000000E0U                       /*!< SYSCLK divided by 256 */
#define RCC_CFGR_HPRE_DIV512                 0x000000F0U                       /*!< SYSCLK divided by 512 */

/*!< PPRE1 configuration */
#define RCC_CFGR_PPRE1_Pos                   (8U)
#define RCC_CFGR_PPRE1_Msk                   (0x7U << RCC_CFGR_PPRE1_Pos)      /*!< 0x00000700 */
#define RCC_CFGR_PPRE1                       RCC_CFGR_PPRE1_Msk                /*!< PRE1[2:0] bits (APB1 prescaler) */
#define RCC_CFGR_PPRE1_0                     (0x1U << RCC_CFGR_PPRE1_Pos)      /*!< 0x00000100 */
#define RCC_CFGR_PPRE1_1                     (0x2U << RCC_CFGR_PPRE1_Pos)      /*!< 0x00000200 */
#define RCC_CFGR_PPRE1_2                     (0x4U << RCC_CFGR_PPRE1_Pos)      /*!< 0x00000400 */

#define RCC_CFGR_PPRE1_DIV1                  0x00000000U                       /*!< HCLK not divided */
#define RCC_CFGR_PPRE1_DIV2                  0x00000400U                       /*!< HCLK divided by 2 */
#define RCC_CFGR_PPRE1_DIV4                  0x00000500U                       /*!< HCLK divided by 4 */
#define RCC_CFGR_PPRE1_DIV8                  0x00000600U                       /*!< HCLK divided by 8 */
#define RCC_CFGR_PPRE1_DIV16                 0x00000700U                       /*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define RCC_CFGR_PPRE2_Pos                   (11U)
#define RCC_CFGR_PPRE2_Msk                   (0x7U << RCC_CFGR_PPRE2_Pos)      /*!< 0x00003800 */
#define RCC_CFGR_PPRE2                       RCC_CFGR_PPRE2_Msk                /*!< PRE2[2:0] bits (APB2 prescaler) */
#define RCC_CFGR_PPRE2_0                     (0x1U << RCC_CFGR_PPRE2_Pos)      /*!< 0x00000800 */
#define RCC_CFGR_PPRE2_1                     (0x2U << RCC_CFGR_PPRE2_Pos)      /*!< 0x00001000 */
#define RCC_CFGR_PPRE2_2                     (0x4U << RCC_CFGR_PPRE2_Pos)      /*!< 0x00002000 */

#define RCC_CFGR_PPRE2_DIV1                  0x00000000U                       /*!< HCLK not divided */
#define RCC_CFGR_PPRE2_DIV2                  0x00002000U                       /*!< HCLK divided by 2 */
#define RCC_CFGR_PPRE2_DIV4                  0x00002800U                       /*!< HCLK divided by 4 */
#define RCC_CFGR_PPRE2_DIV8                  0x00003000U                       /*!< HCLK divided by 8 */
#define RCC_CFGR_PPRE2_DIV16                 0x00003800U                       /*!< HCLK divided by 16 */

/*!< ADCPPRE configuration */
#define RCC_CFGR_ADCPRE_Pos                  (14U)
#define RCC_CFGR_ADCPRE_Msk                  ((0x3U << RCC_CFGR_ADCPRE_Pos)|(0x1U<<28))     /*!< 0x0000C000 */
#define RCC_CFGR_ADCPRE                      RCC_CFGR_ADCPRE_Msk               /*!< ADCPRE[2:0] bits (ADC prescaler) */
#define RCC_CFGR_ADCPRE_0                    (0x1U << RCC_CFGR_ADCPRE_Pos)     /*!< 0x00004000 */
#define RCC_CFGR_ADCPRE_1                    (0x2U << RCC_CFGR_ADCPRE_Pos)     /*!< 0x00008000 */
#define RCC_CFGR_ADCPRE_2                    (0x1U << 28)                      /*!< 0x10000000 */

#define RCC_CFGR_ADCPRE_DIV2                 0x00000000U                       /*!< PCLK2 divided by 2 */
#define RCC_CFGR_ADCPRE_DIV4                 0x00004000U                       /*!< PCLK2 divided by 4 */
#define RCC_CFGR_ADCPRE_DIV6                 0x00008000U                       /*!< PCLK2 divided by 6 */
#define RCC_CFGR_ADCPRE_DIV8                 0x0000C000U                       /*!< PCLK2 divided by 8 */
#define RCC_CFGR_ADCPRE_DIV12                0x10004000U                       /*!< PCLK2 divided by 12 */
#define RCC_CFGR_ADCPRE_DIV16                0x1000C000U                       /*!< PCLK2 divided by 16 */

#define RCC_CFGR_PLLSRC_Pos                  (16U)
#define RCC_CFGR_PLLSRC_Msk                  (0x1U << RCC_CFGR_PLLSRC_Pos)     /*!< 0x00010000 */
#define RCC_CFGR_PLLSRC                      RCC_CFGR_PLLSRC_Msk               /*!< PLL entry clock source */

#define RCC_CFGR_PLLXTPRE_Pos                (17U)
#define RCC_CFGR_PLLXTPRE_Msk                (0x1U << RCC_CFGR_PLLXTPRE_Pos)   /*!< 0x00020000 */
#define RCC_CFGR_PLLXTPRE                    RCC_CFGR_PLLXTPRE_Msk             /*!< HSE divider for PLL entry */

/*!< PLLMUL configuration */
#define RCC_CFGR_PLLMULL_Pos                 (18U)
#define RCC_CFGR_PLLMULL_Msk                 ((0xFU << RCC_CFGR_PLLMULL_Pos) | (0x3U<<29))    /*!< 0x603C0000 */
#define RCC_CFGR_PLLMULL                     RCC_CFGR_PLLMULL_Msk              /*!< PLLMUL[5:0] bits (PLL multiplication factor) */
#define RCC_CFGR_PLLMULL_0                   (0x1U << RCC_CFGR_PLLMULL_Pos)    /*!< 0x00040000 */
#define RCC_CFGR_PLLMULL_1                   (0x2U << RCC_CFGR_PLLMULL_Pos)    /*!< 0x00080000 */
#define RCC_CFGR_PLLMULL_2                   (0x4U << RCC_CFGR_PLLMULL_Pos)    /*!< 0x00100000 */
#define RCC_CFGR_PLLMULL_3                   (0x8U << RCC_CFGR_PLLMULL_Pos)    /*!< 0x00200000 */
// upper 2 bits
#define RCC_CFGR_PLLMULL_4                   (0x1U << 29)                      /*!< 0x20000000 */
#define RCC_CFGR_PLLMULL_5                   (0x2U << 29)                      /*!< 0x40000000 */

#define RCC_CFGR_PLLXTPRE_HSE                0x00000000U                      /*!< HSE clock not divided for PLL entry */
#define RCC_CFGR_PLLXTPRE_HSE_DIV2           0x00020000U                      /*!< HSE clock divided by HSE_DIV_CTRL for PLL entry */

#define RCC_CFGR_PLLMULL2                    0x00000000U                       /*!< PLL input clock*2 */
#define RCC_CFGR_PLLMULL3_Pos                (18U)
#define RCC_CFGR_PLLMULL3_Msk                (0x1U << RCC_CFGR_PLLMULL3_Pos)   /*!< 0x00040000 */
#define RCC_CFGR_PLLMULL3                    RCC_CFGR_PLLMULL3_Msk             /*!< PLL input clock*3 */
#define RCC_CFGR_PLLMULL4_Pos                (19U)
#define RCC_CFGR_PLLMULL4_Msk                (0x1U << RCC_CFGR_PLLMULL4_Pos)   /*!< 0x00080000 */
#define RCC_CFGR_PLLMULL4                    RCC_CFGR_PLLMULL4_Msk             /*!< PLL input clock*4 */
#define RCC_CFGR_PLLMULL5_Pos                (18U)
#define RCC_CFGR_PLLMULL5_Msk                (0x3U << RCC_CFGR_PLLMULL5_Pos)   /*!< 0x000C0000 */
#define RCC_CFGR_PLLMULL5                    RCC_CFGR_PLLMULL5_Msk             /*!< PLL input clock*5 */
#define RCC_CFGR_PLLMULL6_Pos                (20U)
#define RCC_CFGR_PLLMULL6_Msk                (0x1U << RCC_CFGR_PLLMULL6_Pos)   /*!< 0x00100000 */
#define RCC_CFGR_PLLMULL6                    RCC_CFGR_PLLMULL6_Msk             /*!< PLL input clock*6 */
#define RCC_CFGR_PLLMULL7_Pos                (18U)
#define RCC_CFGR_PLLMULL7_Msk                (0x5U << RCC_CFGR_PLLMULL7_Pos)   /*!< 0x00140000 */
#define RCC_CFGR_PLLMULL7                    RCC_CFGR_PLLMULL7_Msk             /*!< PLL input clock*7 */
#define RCC_CFGR_PLLMULL8_Pos                (19U)
#define RCC_CFGR_PLLMULL8_Msk                (0x3U << RCC_CFGR_PLLMULL8_Pos)   /*!< 0x00180000 */
#define RCC_CFGR_PLLMULL8                    RCC_CFGR_PLLMULL8_Msk             /*!< PLL input clock*8 */
#define RCC_CFGR_PLLMULL9_Pos                (18U)
#define RCC_CFGR_PLLMULL9_Msk                (0x7U << RCC_CFGR_PLLMULL9_Pos)   /*!< 0x001C0000 */
#define RCC_CFGR_PLLMULL9                    RCC_CFGR_PLLMULL9_Msk             /*!< PLL input clock*9 */
#define RCC_CFGR_PLLMULL10_Pos               (21U)
#define RCC_CFGR_PLLMULL10_Msk               (0x1U << RCC_CFGR_PLLMULL10_Pos)  /*!< 0x00200000 */
#define RCC_CFGR_PLLMULL10                   RCC_CFGR_PLLMULL10_Msk            /*!< PLL input clock*10 */
#define RCC_CFGR_PLLMULL11_Pos               (18U)
#define RCC_CFGR_PLLMULL11_Msk               (0x9U << RCC_CFGR_PLLMULL11_Pos)  /*!< 0x00240000 */
#define RCC_CFGR_PLLMULL11                   RCC_CFGR_PLLMULL11_Msk            /*!< PLL input clock*11 */
#define RCC_CFGR_PLLMULL12_Pos               (19U)
#define RCC_CFGR_PLLMULL12_Msk               (0x5U << RCC_CFGR_PLLMULL12_Pos)  /*!< 0x00280000 */
#define RCC_CFGR_PLLMULL12                   RCC_CFGR_PLLMULL12_Msk            /*!< PLL input clock*12 */
#define RCC_CFGR_PLLMULL13_Pos               (18U)
#define RCC_CFGR_PLLMULL13_Msk               (0xBU << RCC_CFGR_PLLMULL13_Pos)  /*!< 0x002C0000 */
#define RCC_CFGR_PLLMULL13                   RCC_CFGR_PLLMULL13_Msk            /*!< PLL input clock*13 */
#define RCC_CFGR_PLLMULL14_Pos               (20U)
#define RCC_CFGR_PLLMULL14_Msk               (0x3U << RCC_CFGR_PLLMULL14_Pos)  /*!< 0x00300000 */
#define RCC_CFGR_PLLMULL14                   RCC_CFGR_PLLMULL14_Msk            /*!< PLL input clock*14 */
#define RCC_CFGR_PLLMULL15_Pos               (18U)
#define RCC_CFGR_PLLMULL15_Msk               (0xDU << RCC_CFGR_PLLMULL15_Pos)  /*!< 0x00340000 */
#define RCC_CFGR_PLLMULL15                   RCC_CFGR_PLLMULL15_Msk            /*!< PLL input clock*15 */
#define RCC_CFGR_PLLMULL16_Pos               (19U)
#define RCC_CFGR_PLLMULL16_Msk               (0x7U << RCC_CFGR_PLLMULL16_Pos)  /*!< 0x00380000 */
#define RCC_CFGR_PLLMULL16                   RCC_CFGR_PLLMULL16_Msk            /*!< PLL input clock*16 */

//upper 2 bits required for higher multipliers
#define RCC_CFGR_PLLMULL17                   (0x1U << 29) | RCC_CFGR_PLLMULL2  /*!< PLL input clock*17 */
#define RCC_CFGR_PLLMULL18                   (0x1U << 29) | RCC_CFGR_PLLMULL3  /*!< PLL input clock*18 */
#define RCC_CFGR_PLLMULL19                   (0x1U << 29) | RCC_CFGR_PLLMULL4  /*!< PLL input clock*19 */
#define RCC_CFGR_PLLMULL20                   (0x1U << 29) | RCC_CFGR_PLLMULL5  /*!< PLL input clock*20 */
#define RCC_CFGR_PLLMULL21                   (0x1U << 29) | RCC_CFGR_PLLMULL6  /*!< PLL input clock*21 */
#define RCC_CFGR_PLLMULL22                   (0x1U << 29) | RCC_CFGR_PLLMULL7  /*!< PLL input clock*22 */
#define RCC_CFGR_PLLMULL23                   (0x1U << 29) | RCC_CFGR_PLLMULL8  /*!< PLL input clock*23 */
#define RCC_CFGR_PLLMULL24                   (0x1U << 29) | RCC_CFGR_PLLMULL9  /*!< PLL input clock*24 */
#define RCC_CFGR_PLLMULL25                   (0x1U << 29) | RCC_CFGR_PLLMULL10 /*!< PLL input clock*25 */
#define RCC_CFGR_PLLMULL26                   (0x1U << 29) | RCC_CFGR_PLLMULL11 /*!< PLL input clock*26 */
#define RCC_CFGR_PLLMULL27                   (0x1U << 29) | RCC_CFGR_PLLMULL12 /*!< PLL input clock*27 */
#define RCC_CFGR_PLLMULL28                   (0x1U << 29) | RCC_CFGR_PLLMULL13 /*!< PLL input clock*28 */
#define RCC_CFGR_PLLMULL29                   (0x1U << 29) | RCC_CFGR_PLLMULL14 /*!< PLL input clock*29 */
#define RCC_CFGR_PLLMULL30                   (0x1U << 29) | RCC_CFGR_PLLMULL15 /*!< PLL input clock*30 */
#define RCC_CFGR_PLLMULL31                   (0x1U << 29) | (0xEU<<18)         /*!< PLL input clock*31 */
#define RCC_CFGR_PLLMULL32                   (0x1U << 29) | RCC_CFGR_PLLMULL16 /*!< PLL input clock*32 */
#define RCC_CFGR_PLLMULL33                   (0x1U << 30) | RCC_CFGR_PLLMULL2  /*!< PLL input clock*33 */
#define RCC_CFGR_PLLMULL34                   (0x1U << 30) | RCC_CFGR_PLLMULL3  /*!< PLL input clock*34 */
#define RCC_CFGR_PLLMULL35                   (0x1U << 30) | RCC_CFGR_PLLMULL4  /*!< PLL input clock*35 */
#define RCC_CFGR_PLLMULL36                   (0x1U << 30) | RCC_CFGR_PLLMULL5  /*!< PLL input clock*36 */
#define RCC_CFGR_PLLMULL37                   (0x1U << 30) | RCC_CFGR_PLLMULL6  /*!< PLL input clock*37 */
#define RCC_CFGR_PLLMULL38                   (0x1U << 30) | RCC_CFGR_PLLMULL7  /*!< PLL input clock*38 */
#define RCC_CFGR_PLLMULL39                   (0x1U << 30) | RCC_CFGR_PLLMULL8  /*!< PLL input clock*39 */
#define RCC_CFGR_PLLMULL40                   (0x1U << 30) | RCC_CFGR_PLLMULL9  /*!< PLL input clock*40 */
#define RCC_CFGR_PLLMULL41                   (0x1U << 30) | RCC_CFGR_PLLMULL10 /*!< PLL input clock*41 */
#define RCC_CFGR_PLLMULL42                   (0x1U << 30) | RCC_CFGR_PLLMULL11 /*!< PLL input clock*42 */
#define RCC_CFGR_PLLMULL43                   (0x1U << 30) | RCC_CFGR_PLLMULL12 /*!< PLL input clock*43 */
#define RCC_CFGR_PLLMULL44                   (0x1U << 30) | RCC_CFGR_PLLMULL13 /*!< PLL input clock*44 */
#define RCC_CFGR_PLLMULL45                   (0x1U << 30) | RCC_CFGR_PLLMULL14 /*!< PLL input clock*45 */
#define RCC_CFGR_PLLMULL46                   (0x1U << 30) | RCC_CFGR_PLLMULL15 /*!< PLL input clock*46 */
#define RCC_CFGR_PLLMULL47                   (0x1U << 30) | (0xEU<<18)         /*!< PLL input clock*47 */
#define RCC_CFGR_PLLMULL48                   (0x1U << 30) | RCC_CFGR_PLLMULL16 /*!< PLL input clock*48 */
#define RCC_CFGR_PLLMULL49                   (0x3U << 29) | RCC_CFGR_PLLMULL2  /*!< PLL input clock*49 */
#define RCC_CFGR_PLLMULL50                   (0x3U << 29) | RCC_CFGR_PLLMULL3  /*!< PLL input clock*50 */
#define RCC_CFGR_PLLMULL51                   (0x3U << 29) | RCC_CFGR_PLLMULL4  /*!< PLL input clock*51 */
#define RCC_CFGR_PLLMULL52                   (0x3U << 29) | RCC_CFGR_PLLMULL5  /*!< PLL input clock*52 */
#define RCC_CFGR_PLLMULL53                   (0x3U << 29) | RCC_CFGR_PLLMULL6  /*!< PLL input clock*53 */
#define RCC_CFGR_PLLMULL54                   (0x3U << 29) | RCC_CFGR_PLLMULL7  /*!< PLL input clock*54 */
#define RCC_CFGR_PLLMULL55                   (0x3U << 29) | RCC_CFGR_PLLMULL8  /*!< PLL input clock*55 */
#define RCC_CFGR_PLLMULL56                   (0x3U << 29) | RCC_CFGR_PLLMULL9  /*!< PLL input clock*56 */
#define RCC_CFGR_PLLMULL57                   (0x3U << 29) | RCC_CFGR_PLLMULL10 /*!< PLL input clock*57 */
#define RCC_CFGR_PLLMULL58                   (0x3U << 29) | RCC_CFGR_PLLMULL11 /*!< PLL input clock*58 */
#define RCC_CFGR_PLLMULL59                   (0x3U << 29) | RCC_CFGR_PLLMULL12 /*!< PLL input clock*59 */
#define RCC_CFGR_PLLMULL60                   (0x3U << 29) | RCC_CFGR_PLLMULL13 /*!< PLL input clock*60 */
#define RCC_CFGR_PLLMULL61                   (0x3U << 29) | RCC_CFGR_PLLMULL14 /*!< PLL input clock*61 */
#define RCC_CFGR_PLLMULL62                   (0x3U << 29) | RCC_CFGR_PLLMULL15 /*!< PLL input clock*62 */
#define RCC_CFGR_PLLMULL63                   (0x3U << 29) | (0xEU<<18)         /*!< PLL input clock*63 */
#define RCC_CFGR_PLLMULL64                   (0x3U << 29) | RCC_CFGR_PLLMULL16 /*!< PLL input clock*64 */

#define RCC_CFGR_USBPRE_Pos                  (22U)
#define RCC_CFGR_USBPRE_Msk                  ((0x3U << RCC_CFGR_USBPRE_Pos) | (0x1U << 27))     /*!< 0x08C00000 */
#define RCC_CFGR_USBPRE                      RCC_CFGR_USBPRE_Msk               /*!< USB Device prescaler */
#define RCC_CFGR_USBPRE_0                    (0x1U << RCC_CFGR_USBPRE_Pos)
#define RCC_CFGR_USBPRE_1                    (0x2U << RCC_CFGR_USBPRE_Pos)
#define RCC_CFGR_USBPRE_2                    (0x1U << 27)

#define RCC_CFGR_USBPRE0                     (RCC_CFGR_USBPRE_0)                                        /*!< PLL clock divided by 1 */
#define RCC_CFGR_USBPRE1P5                   0x00000000U                                                /*!< PLL clock divided by 1.5 */
#define RCC_CFGR_USBPRE2                     (RCC_CFGR_USBPRE_1|RCC_CFGR_USBPRE_0)                      /*!< PLL clock divided by 2 */
#define RCC_CFGR_USBPRE2P5                   (RCC_CFGR_USBPRE_1)                                        /*!< PLL clock divided by 2.5 */
#define RCC_CFGR_USBPRE3                     (RCC_CFGR_USBPRE_2|RCC_CFGR_USBPRE_0)                      /*!< PLL clock divided by 3 */
#define RCC_CFGR_USBPRE3P5                   (RCC_CFGR_USBPRE_2)                                        /*!< PLL clock divided by 3.5 */
#define RCC_CFGR_USBPRE4                     (RCC_CFGR_USBPRE_2|RCC_CFGR_USBPRE_1)                      /*!< PLL clock divided by 4 */
#define RCC_CFGR_USBPRE4P5                   (RCC_CFGR_USBPRE_2|RCC_CFGR_USBPRE_1|RCC_CFGR_USBPRE_0)    /*!< PLL clock divided by 4.5 */

/*!< MCO configuration */
//aka CLKOUT
#define RCC_CFGR_MCO_Pos                     (24U)
#define RCC_CFGR_MCO_Msk                     (0x7U << RCC_CFGR_MCO_Pos)        /*!< 0x07000000 */
#define RCC_CFGR_MCO                         RCC_CFGR_MCO_Msk                  /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define RCC_CFGR_MCO_0                       (0x1U << RCC_CFGR_MCO_Pos)        /*!< 0x01000000 */
#define RCC_CFGR_MCO_1                       (0x2U << RCC_CFGR_MCO_Pos)        /*!< 0x02000000 */
#define RCC_CFGR_MCO_2                       (0x4U << RCC_CFGR_MCO_Pos)        /*!< 0x04000000 */

